 JAVA题[任做2道] (每题 5分)
1. JVM的类加载机制是什么?有哪些实现方式?

2. JVM的常见垃圾回收算法?

3. JVM调优的常见命令行工具有哪些? JVM常见的调优参数有哪些?

4.在重写equals方法时，需要遵循哪些约定，具体介绍一下?

5. Synchronized 优化后的锁机制简单介绍下，包括自旋锁、偏向锁、轻量级锁、重量级锁?
6. Redis的持久化机制是什么?各自的优缺点?
7. mysql的数据库表锁、行锁页级锁?
 8.数据库的四大特征，数据库的隔离级别?
2 hadoop题[任做2道] (每题 5分)
1.简述Zokeepe选举机制
2. Rowkey设计原则
3. Hive 的动态分区利静态分区
4.MR的工作原理
5. F1ume栏截器有哪些?
3数仓[任做2道] (每题10分)
1.简述一个数仓架构以及分层结构?
2.你了解哪些模型，说说其区别
3.什么是维度表?什么是事宝表?
4.数仓的元数据管理?
4Spark题任做2道1 (每题10分) 
1. SparkSQL的SQL风格和DSL风格你怎么看风格你怎么看7
2. Spark Shuffle和MR sff1e的区别?
3. Spark的任务现交流程?
4. updateStateByKey和mapkWithstate的区别2
5. Sark-On-Yarn 的Cluster模式和Clent模式区别及其各自原理7
手写代码题(任选其一，每题10分)

1. scala实现手写快排?
2. scald实现坚故事熨数到?


































